import os
 
pathNames = ['1.1.4钻具和套管提起卸护丝、配合接头时，手、脚放在接头下方。',
             '1.1.6井口操作时用脚蹬吊卡。',
             '1.1.7用B型吊钳单钳紧扣（装卸钻头除外）。',
             '1.1.8使用液气大钳钳框未扣合。',
             '1.1.14起下钻未用钻杆钩子拉钻具立柱、单根。',
             '1.1.15将提升短节推倒放置在钻台面上。',
             '1.1.44操作人员起下钻过程蹲着刮泥浆。',
             '1.1.46未按规定遮盖井口及鼠洞。（5分钟）',
             '1.1.49正常作业时钻台坡道大门安全链未挂。（5分钟）',
             '1.1.51钻台打雨伞。',
             '1.1.52作业时将水杯放在工装中。',
             '0.1.1.进入井场未带安全帽。Ok',
             '0.1.1.安全帽带未系紧。',
             '0.1.1.进入井场未穿工衣。',
             '0.1.1.工衣着装不规范。（检测领口超2个扣子未系，袖口扣子未系）',
             '0.1.1.进入井场未佩戴护目镜。',
             '0.1.1.佩戴护目镜不规范。（将护目镜戴至脑后）',
             '0.2.19作业场所禁烟区吸烟。',
             '0.2.24故意遮挡或损坏视频监控摄像头。',
             '0.2.19井场范围内吸烟。'
            ]

def mkdir(path):

	folder = os.path.exists(path)
 
	if not folder:                   #判断是否存在文件夹如果不存在则创建为文件夹
		os.makedirs(path)            #makedirs 创建文件时如果路径不存在会创建这个路径
		print("---  OK  ---")
	else:
		print("---  There has this folder!  ---")


if __name__ == "__main__":
    for item in pathNames:
        path = './' + item 
        mkdir(path)             #调用函数
